[
    {
        "id": 1,
        "image": "./projects/weatherApp.png",
        "title": "Weather Dashboard",
        "desc": "A dynamic weather dashboard application to provide current weather forecast and a 5 day future forecast. This application runs with the use of the Open Weather API. ",
        "github": "https://github.com/AlexAins/Weather-Dashboard" ,
        "deployed": true,
        "deployedURL": "https://alexains.github.io/Weather-Dashboard/"
    },
    {
        "id": 2,
        "image": "./projects/dailyPlanner.png",
        "title": "Daily Planner App",
        "desc": "This is a basic daily planner allowing the user to add events to organize their time. A dynamic application using JQuery to update the HTML and CSS, to show the current time, and saving user inputs allowing them to return to their planner at a later time.",
        "github": "https://github.com/AlexAins/Daily-Planner-App",
        "deployed": true,
        "deployedURL": "https://alexains.github.io/Daily-Planner-App/"
    },
    {
        "id": 3,
        "image": "./projects/codingQuiz.png",
        "title": "Coding Quiz App",
        "desc": "A coding quiz about various HTML, CSS and JavaScript subjects. It gives the user 100 seconds to answer 10 questions, removing time for an incorrect answer. This then provides the user the option to save their score along with initials to a leaderboard.",
        "github": "https://github.com/AlexAins/Coding-Quiz",
        "deployed": true,
        "deployedURL": "https://alexains.github.io/Coding-Quiz/"
    },
    {
        "id": 4,
        "image": "./projects/passwordGenerator.png",
        "title": "Password Generator",
        "desc": "Application to provide the user a random password, allowing the user to choose the length of password and type of characters to include within this password.",
        "github": "https://github.com/AlexAins/Password-Generator",
        "deployed": true,
        "deployedURL": "https://alexains.github.io/Password-Generator/"
    },
    {
        "id": 5,
        "image": "./projects/teamGenerator.png",
        "title": "Team Profile Generator",
        "desc": "This Node.JS command-line application generates a team profile. Allowing the user to add one manager and various employees and include information such as name, ID, email and more. When the user completes the inputs, a HTML page is generated with the provided information. This project is developed using Node.JS and NPM with the use of Inquirer, Path, FS packages and Jest. ",
        "github": "https://github.com/AlexAins/Team-Profile-Generator",
        "deployed": false,
        "deployedURL": ""
    },
    {
        "id": 6,
        "image": "./projects/READMEgenerator.webp",
        "title": "READMe Generator",
        "desc": "This is a Node.JS command-line application to generate high-quality READMEs for your projects. This is done by asking the project creator questions to allow the generator to gain the necessary information to create a professional README. This project is developed using Node.JS and NPM with the use of Inquirer and FS packages.",
        "github": "https://github.com/AlexAins/README-Generator",
        "deployed": false,
        "deployedURL": "" 
    }
]